## Terragrunt Plan: `test` ✅ Success

<details>
<summary>Show Plan Output</summary>

```
time=2025-10-23T23:04:00Z level=info msg=The stack at /home/runner/work/terragrunt-azure-deployment/terragrunt-azure-deployment/terraform/live/test will be processed in the following order for command plan:
Group 1
- Module /home/runner/work/terragrunt-azure-deployment/terragrunt-azure-deployment/terraform/live/test
- Module /home/runner/work/terragrunt-azure-deployment/terragrunt-azure-deployment/terraform/live/test/monitoring
- Module /home/runner/work/terragrunt-azure-deployment/terragrunt-azure-deployment/terraform/live/test/network
- Module /home/runner/work/terragrunt-azure-deployment/terragrunt-azure-deployment/terraform/live/test/sql

Group 2
- Module /home/runner/work/terragrunt-azure-deployment/terragrunt-azure-deployment/terraform/live/test/aks
- Module /home/runner/work/terragrunt-azure-deployment/terragrunt-azure-deployment/terraform/live/test/keyvault



No changes. Your infrastructure matches the configuration.

Terraform has compared your real infrastructure against your configuration
and found no differences, so no changes are needed.

Initializing the backend...

Initializing provider plugins...
- Reusing previous version of hashicorp/azurerm from the dependency lock file
- Using previously-installed hashicorp/azurerm v4.49.0

Terraform has been successfully initialized!

You may now begin working with Terraform. Try running "terraform plan" to see
any changes that are required for your infrastructure. All Terraform commands
should now work.

If you ever set or change modules or backend configuration for Terraform,
rerun this command to reinitialize your working directory. If you forget, other
commands will detect it and remind you to do so if necessary.

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # azurerm_mssql_database.this will be created
  + resource "azurerm_mssql_database" "this" {
      + auto_pause_delay_in_minutes                                = (known after apply)
      + collation                                                  = "SQL_Latin1_General_CP1_CI_AS"
      + create_mode                                                = "Default"
      + creation_source_database_id                                = (known after apply)
      + enclave_type                                               = (known after apply)
      + geo_backup_enabled                                         = true
      + id                                                         = (known after apply)
      + ledger_enabled                                             = (known after apply)
      + license_type                                               = (known after apply)
      + maintenance_configuration_name                             = (known after apply)
      + max_size_gb                                                = 2
      + min_capacity                                               = (known after apply)
      + name                                                       = "testdb"
      + read_replica_count                                         = (known after apply)
      + read_scale                                                 = (known after apply)
      + restore_point_in_time                                      = (known after apply)
      + sample_name                                                = (known after apply)
      + secondary_type                                             = (known after apply)
      + server_id                                                  = (known after apply)
      + sku_name                                                   = "Basic"
      + storage_account_type                                       = "Geo"
      + tags                                                       = {
          + "Environment" = "test"
          + "Project"     = "CAI-Database"
          + "Purpose"     = "Integration-Testing"
        }
      + transparent_data_encryption_enabled                        = true
      + transparent_data_encryption_key_automatic_rotation_enabled = false
      + zone_redundant                                             = (known after apply)

      + long_term_retention_policy {
          + immutable_backups_enabled = (known after apply)
          + monthly_retention         = (known after apply)
          + week_of_year              = (known after apply)
          + weekly_retention          = (known after apply)
          + yearly_retention          = (known after apply)
        }

      + short_term_retention_policy {
          + backup_interval_in_hours = (known after apply)
          + retention_days           = (known after apply)
        }

      + threat_detection_policy {
          + disabled_alerts            = (known after apply)
          + email_account_admins       = (known after apply)
          + email_addresses            = (known after apply)
          + retention_days             = (known after apply)
          + state                      = (known after apply)
          + storage_account_access_key = (sensitive value)
          + storage_endpoint           = (known after apply)
        }
    }

  # azurerm_mssql_server.this will be created
  + resource "azurerm_mssql_server" "this" {
      + administrator_login                      = "testadmin"
      + administrator_login_password             = (sensitive value)
      + connection_policy                        = "Default"
      + express_vulnerability_assessment_enabled = false
      + fully_qualified_domain_name              = (known after apply)
      + id                                       = (known after apply)
      + location                                 = "westus2"
      + minimum_tls_version                      = "1.2"
      + name                                     = "cai-aks-test-v2-sql"
      + outbound_network_restriction_enabled     = false
      + primary_user_assigned_identity_id        = (known after apply)
      + public_network_access_enabled            = true
      + resource_group_name                      = "test-rg"
      + restorable_dropped_database_ids          = (known after apply)
      + tags                                     = {
          + "Environment" = "test"
          + "ManagedBy"   = "Terragrunt"
          + "Project"     = "CAI-Database"
          + "Purpose"     = "Integration-Testing"
        }
      + version                                  = "12.0"
    }

Plan: 2 to add, 0 to change, 0 to destroy.

Changes to Outputs:
  + sql_connection_string = (sensitive value)
  + sql_database_name     = "testdb"
  + sql_server_name       = "cai-aks-test-v2-sql"

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.

Initializing the backend...

Initializing provider plugins...
- Reusing previous version of hashicorp/azurerm from the dependency lock file
- Using previously-installed hashicorp/azurerm v4.49.0

Terraform has been successfully initialized!

You may now begin working with Terraform. Try running "terraform plan" to see
any changes that are required for your infrastructure. All Terraform commands
should now work.

If you ever set or change modules or backend configuration for Terraform,
rerun this command to reinitialize your working directory. If you forget, other
commands will detect it and remind you to do so if necessary.

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # azurerm_application_insights.this will be created
  + resource "azurerm_application_insights" "this" {
      + app_id                              = (known after apply)
      + application_type                    = "web"
      + connection_string                   = (sensitive value)
      + daily_data_cap_in_gb                = 100
      + disable_ip_masking                  = false
      + force_customer_storage_for_profiler = false
      + id                                  = (known after apply)
      + instrumentation_key                 = (sensitive value)
      + internet_ingestion_enabled          = true
      + internet_query_enabled              = true
      + local_authentication_disabled       = false
      + location                            = "westus2"
      + name                                = "cai-aks-test-insights"
      + resource_group_name                 = "test-rg"
      + retention_in_days                   = 90
      + sampling_percentage                 = 100
      + tags                                = {
          + "Environment" = "test"
          + "ManagedBy"   = "Terragrunt"
          + "Project"     = "CAI-Kubernetes"
        }
      + workspace_id                        = (known after apply)
    }

  # azurerm_log_analytics_workspace.this will be created
  + resource "azurerm_log_analytics_workspace" "this" {
      + allow_resource_only_permissions = true
      + daily_quota_gb                  = -1
      + id                              = (known after apply)
      + internet_ingestion_enabled      = true
      + internet_query_enabled          = true
      + local_authentication_disabled   = (known after apply)
      + local_authentication_enabled    = (known after apply)
      + location                        = "westus2"
      + name                            = "cai-aks-test-logs"
      + primary_shared_key              = (sensitive value)
      + resource_group_name             = "test-rg"
      + retention_in_days               = 30
      + secondary_shared_key            = (sensitive value)
      + sku                             = "PerGB2018"
      + tags                            = {
          + "Environment" = "test"
          + "ManagedBy"   = "Terragrunt"
          + "Project"     = "CAI-Kubernetes"
        }
      + workspace_id                    = (known after apply)
    }

Plan: 2 to add, 0 to change, 0 to destroy.

Changes to Outputs:
  + application_insights_instrumentation_key = (sensitive value)
  + log_analytics_workspace_id               = (known after apply)

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.

Initializing the backend...

Initializing provider plugins...
- Reusing previous version of hashicorp/azurerm from the dependency lock file
- Using previously-installed hashicorp/azurerm v4.49.0

Terraform has been successfully initialized!

You may now begin working with Terraform. Try running "terraform plan" to see
any changes that are required for your infrastructure. All Terraform commands
should now work.

If you ever set or change modules or backend configuration for Terraform,
rerun this command to reinitialize your working directory. If you forget, other
commands will detect it and remind you to do so if necessary.

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # azurerm_network_security_group.aks will be created
  + resource "azurerm_network_security_group" "aks" {
      + id                  = (known after apply)
      + location            = "westus2"
      + name                = "cai-aks-test-nsg"
      + resource_group_name = "test-rg"
      + security_rule       = [
          + {
              + access                                     = "Allow"
              + description                                = ""
              + destination_address_prefix                 = "*"
              + destination_address_prefixes               = []
              + destination_application_security_group_ids = []
              + destination_port_range                     = "*"
              + destination_port_ranges                    = []
              + direction                                  = "Inbound"
              + name                                       = "AllowAKSTraffic"
              + priority                                   = 1001
              + protocol                                   = "*"
              + source_address_prefix                      = "10.0.0.0/16"
              + source_address_prefixes                    = []
              + source_application_security_group_ids      = []
              + source_port_range                          = "*"
              + source_port_ranges                         = []
            },
        ]
      + tags                = {
          + "Environment" = "test"
          + "ManagedBy"   = "Terragrunt"
          + "Project"     = "CAI-Network"
        }
    }

  # azurerm_subnet.aks will be created
  + resource "azurerm_subnet" "aks" {
      + address_prefixes                              = [
          + "10.0.1.0/24",
        ]
      + default_outbound_access_enabled               = true
      + id                                            = (known after apply)
      + name                                          = "aks-subnet"
      + private_endpoint_network_policies             = "Disabled"
      + private_link_service_network_policies_enabled = true
      + resource_group_name                           = "test-rg"
      + virtual_network_name                          = "cai-aks-test-vnet"
    }

  # azurerm_subnet_network_security_group_association.aks will be created
  + resource "azurerm_subnet_network_security_group_association" "aks" {
      + id                        = (known after apply)
      + network_security_group_id = (known after apply)
      + subnet_id                 = (known after apply)
    }

  # azurerm_virtual_network.this will be created
  + resource "azurerm_virtual_network" "this" {
      + address_space                  = [
          + "10.0.0.0/16",
        ]
      + dns_servers                    = (known after apply)
      + guid                           = (known after apply)
      + id                             = (known after apply)
      + location                       = "westus2"
      + name                           = "cai-aks-test-vnet"
      + private_endpoint_vnet_policies = "Disabled"
      + resource_group_name            = "test-rg"
      + subnet                         = (known after apply)
      + tags                           = {
          + "Environment" = "test"
          + "ManagedBy"   = "Terragrunt"
          + "Project"     = "CAI-Network"
        }
    }

Plan: 4 to add, 0 to change, 0 to destroy.

Changes to Outputs:
  + aks_subnet_id   = (known after apply)
  + aks_subnet_name = "aks-subnet"
  + nsg_id          = (known after apply)
  + vnet_id         = (known after apply)
  + vnet_name       = "cai-aks-test-vnet"

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.

Initializing the backend...

Initializing provider plugins...
- Reusing previous version of hashicorp/azurerm from the dependency lock file
- Using previously-installed hashicorp/azurerm v4.49.0

Terraform has been successfully initialized!

You may now begin working with Terraform. Try running "terraform plan" to see
any changes that are required for your infrastructure. All Terraform commands
should now work.

If you ever set or change modules or backend configuration for Terraform,
rerun this command to reinitialize your working directory. If you forget, other
commands will detect it and remind you to do so if necessary.
data.azurerm_client_config.current: Reading...
data.azurerm_client_config.current: Read complete after 0s [id=Y2xpZW50Q29uZmlncy9jbGllbnRJZD1iNGZjMTNiMC00MDUyLTQ4MjgtYThiMC02ZmI1MjM1MjY5Yzc7b2JqZWN0SWQ9ZGFiOWY5YjQtNjMyZC00MTdlLTk1ZjMtZTU3MGFiMzA2NTBkO3N1YnNjcmlwdGlvbklkPTI3YTU1OGI2LTYwZDQtNGY0My04OTM4LTg1MDE3NTNhZWIxZjt0ZW5hbnRJZD0wYTdmYzI2MC00ODNlLTQzNTgtYmE1MS0xOTI1MzhmZGY1YmQ=]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # azurerm_key_vault.this will be created
  + resource "azurerm_key_vault" "this" {
      + access_policy                 = (known after apply)
      + enable_rbac_authorization     = (known after apply)
      + id                            = (known after apply)
      + location                      = "westus2"
      + name                          = "cai-test-kv"
      + public_network_access_enabled = true
      + purge_protection_enabled      = false
      + rbac_authorization_enabled    = true
      + resource_group_name           = "test-rg"
      + sku_name                      = "standard"
      + soft_delete_retention_days    = 7
      + tags                          = {
          + "Environment" = "test"
          + "ManagedBy"   = "Terragrunt"
          + "Project"     = "CAI-KeyVault"
        }
      + tenant_id                     = "0a7fc260-483e-4358-ba51-192538fdf5bd"
      + vault_uri                     = (known after apply)

      + contact {
          + email = (known after apply)
          + name  = (known after apply)
          + phone = (known after apply)
        }

      + network_acls {
          + bypass                     = (known after apply)
          + default_action             = (known after apply)
          + ip_rules                   = (known after apply)
          + virtual_network_subnet_ids = (known after apply)
        }
    }

  # azurerm_key_vault_secret.default_secrets["application-insights-key"] will be created
  + resource "azurerm_key_vault_secret" "default_secrets" {
      + id                      = (known after apply)
      + key_vault_id            = (known after apply)
      + name                    = "application-insights-key"
      + resource_id             = (known after apply)
      + resource_versionless_id = (known after apply)
      + value                   = (sensitive value)
      + version                 = (known after apply)
      + versionless_id          = (known after apply)
    }

  # azurerm_key_vault_secret.default_secrets["redis-connection"] will be created
  + resource "azurerm_key_vault_secret" "default_secrets" {
      + id                      = (known after apply)
      + key_vault_id            = (known after apply)
      + name                    = "redis-connection"
      + resource_id             = (known after apply)
      + resource_versionless_id = (known after apply)
      + value                   = (sensitive value)
      + version                 = (known after apply)
      + versionless_id          = (known after apply)
    }

  # azurerm_key_vault_secret.default_secrets["sql-connection-string"] will be created
  + resource "azurerm_key_vault_secret" "default_secrets" {
      + id                      = (known after apply)
      + key_vault_id            = (known after apply)
      + name                    = "sql-connection-string"
      + resource_id             = (known after apply)
      + resource_versionless_id = (known after apply)
      + value                   = (sensitive value)
      + version                 = (known after apply)
      + versionless_id          = (known after apply)
    }

  # azurerm_key_vault_secret.default_secrets["test-api-key"] will be created
  + resource "azurerm_key_vault_secret" "default_secrets" {
      + id                      = (known after apply)
      + key_vault_id            = (known after apply)
      + name                    = "test-api-key"
      + resource_id             = (known after apply)
      + resource_versionless_id = (known after apply)
      + value                   = (sensitive value)
      + version                 = (known after apply)
      + versionless_id          = (known after apply)
    }

  # azurerm_role_assignment.kv_admin will be created
  + resource "azurerm_role_assignment" "kv_admin" {
      + condition_version                = (known after apply)
      + id                               = (known after apply)
      + name                             = (known after apply)
      + principal_id                     = "dab9f9b4-632d-417e-95f3-e570ab30650d"
      + principal_type                   = (known after apply)
      + role_definition_id               = (known after apply)
      + role_definition_name             = "Key Vault Administrator"
      + scope                            = (known after apply)
      + skip_service_principal_aad_check = (known after apply)
    }

Plan: 6 to add, 0 to change, 0 to destroy.

Changes to Outputs:
  + id        = (known after apply)
  + name      = "cai-test-kv"
  + vault_uri = (known after apply)

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.

Initializing the backend...

Initializing provider plugins...
- Reusing previous version of hashicorp/azurerm from the dependency lock file
- Reusing previous version of hashicorp/local from the dependency lock file
- Using previously-installed hashicorp/azurerm v4.49.0
- Using previously-installed hashicorp/local v2.5.3

Terraform has been successfully initialized!

You may now begin working with Terraform. Try running "terraform plan" to see
any changes that are required for your infrastructure. All Terraform commands
should now work.

If you ever set or change modules or backend configuration for Terraform,
rerun this command to reinitialize your working directory. If you forget, other
commands will detect it and remind you to do so if necessary.

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # azurerm_kubernetes_cluster.aks will be created
  + resource "azurerm_kubernetes_cluster" "aks" {
      + ai_toolchain_operator_enabled       = false
      + current_kubernetes_version          = (known after apply)
      + dns_prefix                          = "cai-aks-test"
      + fqdn                                = (known after apply)
      + http_application_routing_zone_name  = (known after apply)
      + id                                  = (known after apply)
      + kube_admin_config                   = (sensitive value)
      + kube_admin_config_raw               = (sensitive value)
      + kube_config                         = (sensitive value)
      + kube_config_raw                     = (sensitive value)
      + kubernetes_version                  = "1.33.3"
      + location                            = "westus2"
      + name                                = "cai-aks-test"
      + node_os_upgrade_channel             = "NodeImage"
      + node_resource_group                 = (known after apply)
      + node_resource_group_id              = (known after apply)
      + oidc_issuer_url                     = (known after apply)
      + portal_fqdn                         = (known after apply)
      + private_cluster_enabled             = false
      + private_cluster_public_fqdn_enabled = false
      + private_dns_zone_id                 = (known after apply)
      + private_fqdn                        = (known after apply)
      + resource_group_name                 = "test-rg"
      + role_based_access_control_enabled   = true
      + run_command_enabled                 = true
      + sku_tier                            = "Free"
      + support_plan                        = "KubernetesOfficial"
      + tags                                = {
          + "Environment" = "test"
          + "ManagedBy"   = "Terragrunt"
          + "Project"     = "CAI-Kubernetes"
        }
      + workload_identity_enabled           = false

      + auto_scaler_profile {
          + balance_similar_node_groups                   = (known after apply)
          + daemonset_eviction_for_empty_nodes_enabled    = (known after apply)
          + daemonset_eviction_for_occupied_nodes_enabled = (known after apply)
          + empty_bulk_delete_max                         = (known after apply)
          + expander                                      = (known after apply)
          + ignore_daemonsets_utilization_enabled         = (known after apply)
          + max_graceful_termination_sec                  = (known after apply)
          + max_node_provisioning_time                    = (known after apply)
          + max_unready_nodes                             = (known after apply)
          + max_unready_percentage                        = (known after apply)
          + new_pod_scale_up_delay                        = (known after apply)
          + scale_down_delay_after_add                    = (known after apply)
          + scale_down_delay_after_delete                 = (known after apply)
          + scale_down_delay_after_failure                = (known after apply)
          + scale_down_unneeded                           = (known after apply)
          + scale_down_unready                            = (known after apply)
          + scale_down_utilization_threshold              = (known after apply)
          + scan_interval                                 = (known after apply)
          + skip_nodes_with_local_storage                 = (known after apply)
          + skip_nodes_with_system_pods                   = (known after apply)
        }

      + bootstrap_profile {
          + artifact_source       = (known after apply)
          + container_registry_id = (known after apply)
        }

      + default_node_pool {
          + auto_scaling_enabled = false
          + kubelet_disk_type    = (known after apply)
          + max_pods             = (known after apply)
          + name                 = "default"
          + node_count           = 1
          + node_labels          = (known after apply)
          + orchestrator_version = (known after apply)
          + os_disk_size_gb      = (known after apply)
          + os_disk_type         = "Managed"
          + os_sku               = (known after apply)
          + scale_down_mode      = "Delete"
          + type                 = "VirtualMachineScaleSets"
          + ultra_ssd_enabled    = false
          + vm_size              = "Standard_B2s"
          + vnet_subnet_id       = "/subscriptions/00000000-0000-0000-0000-000000000000/resourceGroups/mock-rg/providers/Microsoft.Network/virtualNetworks/mock-vnet/subnets/mock-subnet"
          + workload_runtime     = (known after apply)
        }

      + identity {
          + principal_id = (known after apply)
          + tenant_id    = (known after apply)
          + type         = "SystemAssigned"
        }

      + kubelet_identity {
          + client_id                 = (known after apply)
          + object_id                 = (known after apply)
          + user_assigned_identity_id = (known after apply)
        }

      + network_profile {
          + dns_service_ip     = "172.16.0.10"
          + ip_versions        = (known after apply)
          + load_balancer_sku  = "standard"
          + network_data_plane = "azure"
          + network_mode       = (known after apply)
          + network_plugin     = "azure"
          + network_policy     = (known after apply)
          + outbound_type      = "loadBalancer"
          + pod_cidr           = (known after apply)
          + pod_cidrs          = (known after apply)
          + service_cidr       = "172.16.0.0/16"
          + service_cidrs      = (known after apply)

          + load_balancer_profile {
              + backend_pool_type           = (known after apply)
              + effective_outbound_ips      = (known after apply)
              + idle_timeout_in_minutes     = (known after apply)
              + managed_outbound_ip_count   = (known after apply)
              + managed_outbound_ipv6_count = (known after apply)
              + outbound_ip_address_ids     = (known after apply)
              + outbound_ip_prefix_ids      = (known after apply)
              + outbound_ports_allocated    = (known after apply)
            }

          + nat_gateway_profile {
              + effective_outbound_ips    = (known after apply)
              + idle_timeout_in_minutes   = (known after apply)
              + managed_outbound_ip_count = (known after apply)
            }
        }

      + oms_agent {
          + log_analytics_workspace_id = "/subscriptions/00000000-0000-0000-0000-000000000000/resourceGroups/mock-rg/providers/Microsoft.OperationalInsights/workspaces/mock-workspace"
          + oms_agent_identity         = (known after apply)
        }

      + windows_profile {
          + admin_password = (sensitive value)
          + admin_username = (known after apply)
          + license        = (known after apply)

          + gmsa {
              + dns_server  = (known after apply)
              + root_domain = (known after apply)
            }
        }
    }

  # local_file.kubeconfig will be created
  + resource "local_file" "kubeconfig" {
      + content              = (sensitive)
      + content_base64sha256 = (known after apply)
      + content_base64sha512 = (known after apply)
      + content_md5          = (known after apply)
      + content_sha1         = (known after apply)
      + content_sha256       = (known after apply)
      + content_sha512       = (known after apply)
      + directory_permission = "0777"
      + file_permission      = "0777"
      + filename             = "./kubeconfig-cai-aks-test.yaml"
      + id                   = (known after apply)
    }

Plan: 2 to add, 0 to change, 0 to destroy.

Changes to Outputs:
  + cluster_name        = "cai-aks-test"
  + kube_config         = (sensitive value)
  + kube_config_raw     = (sensitive value)
  + resource_group_name = "test-rg"

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.

```

</details>

**Environment**: `test`
**Exit Code**: `0`
